{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_24", "sparse": false}, "inbound_nodes": [], "name": "input_24"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_36", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["input_24", 0, 0, {}]]], "name": "conv2d_36"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [1], "name": "input_25", "sparse": false}, "inbound_nodes": [], "name": "input_25"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0014S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_33", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_36", 0, 0, {}], ["input_25", 0, 0, {}]]], "name": "lambda_33"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["lambda_33", 0, 0, {}]]], "name": "max_pooling2d_23"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_37", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]], "name": "conv2d_37"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [1], "name": "input_26", "sparse": false}, "inbound_nodes": [], "name": "input_26"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0014S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_35", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_37", 0, 0, {}], ["input_26", 0, 0, {}]]], "name": "lambda_35"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["lambda_35", 0, 0, {}]]], "name": "max_pooling2d_24"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_38", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]], "name": "conv2d_38"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_25", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "max_pooling2d_25"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_39", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["max_pooling2d_25", 0, 0, {}]]], "name": "conv2d_39"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_26", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]], "name": "max_pooling2d_26"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_40", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["max_pooling2d_26", 0, 0, {}]]], "name": "conv2d_40"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [1], "name": "input_28", "sparse": false}, "inbound_nodes": [], "name": "input_28"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_23", "size": [2, 2]}, "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "name": "up_sampling2d_23"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0014S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_39", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_39", 0, 0, {}], ["input_28", 0, 0, {}]]], "name": "lambda_39"}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_21", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_23", 0, 0, {}]]], "name": "conv2d_transpose_21"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0018S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_40", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_39", 0, 0, {}], ["lambda_39", 0, 0, {}]]], "name": "lambda_40"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_17"}, "inbound_nodes": [[["conv2d_transpose_21", 0, 0, {}], ["lambda_40", 0, 0, {}]]], "name": "add_17"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [1], "name": "input_27", "sparse": false}, "inbound_nodes": [], "name": "input_27"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_24", "size": [2, 2]}, "inbound_nodes": [[["add_17", 0, 0, {}]]], "name": "up_sampling2d_24"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0014S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_37", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_38", 0, 0, {}], ["input_27", 0, 0, {}]]], "name": "lambda_37"}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_22", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_24", 0, 0, {}]]], "name": "conv2d_transpose_22"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0018S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_38", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_38", 0, 0, {}], ["lambda_37", 0, 0, {}]]], "name": "lambda_38"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_18"}, "inbound_nodes": [[["conv2d_transpose_22", 0, 0, {}], ["lambda_38", 0, 0, {}]]], "name": "add_18"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_25", "size": [2, 2]}, "inbound_nodes": [[["add_18", 0, 0, {}]]], "name": "up_sampling2d_25"}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_23", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_25", 0, 0, {}]]], "name": "conv2d_transpose_23"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0018S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_36", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_37", 0, 0, {}], ["lambda_35", 0, 0, {}]]], "name": "lambda_36"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_19"}, "inbound_nodes": [[["conv2d_transpose_23", 0, 0, {}], ["lambda_36", 0, 0, {}]]], "name": "add_19"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_26", "size": [2, 2]}, "inbound_nodes": [[["add_19", 0, 0, {}]]], "name": "up_sampling2d_26"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0018S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000<ipython-input-45-0d813643d712>t\b\u0000\u0000\u0000<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_34", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2d_36", 0, 0, {}], ["lambda_33", 0, 0, {}]]], "name": "lambda_34"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_20"}, "inbound_nodes": [[["up_sampling2d_26", 0, 0, {}], ["lambda_34", 0, 0, {}]]], "name": "add_20"}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_24", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["add_20", 0, 0, {}]]], "name": "conv2d_transpose_24"}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_25", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "filters": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["conv2d_transpose_24", 0, 0, {}]]], "name": "conv2d_transpose_25"}], "input_layers": [["input_24", 0, 0], ["input_25", 0, 0], ["input_26", 0, 0], ["input_27", 0, 0], ["input_28", 0, 0]], "output_layers": [["conv2d_transpose_25", 0, 0]], "name": "model_8"}, "backend": "tensorflow"}